src/InformationRegisters/ОписанияПоОбъектам/ОписанияПоОбъектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписанияПоОбъектам</name>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Заметки</types>
      <types>CatalogRef.Задачи</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Описание</name>
    <type>
      <types>CatalogRef.Описания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОписанияПоОбъектам/ManagerModule.bsl
#Если Сервер Тогда

Функция ДанныеОписания(Объект) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Ссылка");
	Результат.Вставить("Текст");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОписанияПоОбъектам.Описание КАК Ссылка,
	|	ОписанияПоОбъектам.Описание.Текст КАК Текст
	|ИЗ
	|	РегистрСведений.ОписанияПоОбъектам КАК ОписанияПоОбъектам
	|ГДЕ
	|	ОписанияПоОбъектам.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат.Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
		Результат.Текст = ВыборкаДетальныеЗаписи.Текст;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СвязатьОписаниеСОбъектом(Описание, Объект) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Описание = Описание;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ОтвязатьОписаниеОтОбъекта(Объект) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
